In [1]:
%%capture
%load_ext sql
%sql sqlite:///factbook.db

'Connected: None@factbook.db'

In [7]:
%%sql
SELECT * 
    FROM facts
    limit 5;

Done.

[(1, 'af', 'Afghanistan', 652230, 652230, 0, 32564342, 2.32, 38.57, 13.89, 1.51),
 (2, 'al', 'Albania', 28748, 27398, 1350, 3029278, 0.3, 12.92, 6.58, 3.3),
 (3, 'ag', 'Algeria', 2381741, 2381741, 0, 39542166, 1.84, 23.67, 4.31, 0.92),
 (4, 'an', 'Andorra', 468, 468, 0, 85580, 0.12, 8.13, 6.96, 0.0),
 (5, 'ao', 'Angola', 1246700, 1246700, 0, 19625353, 2.78, 38.78, 11.49, 0.46)]

In [5]:
%%sql

select * FROM facts
where name = 'Nigeria'
limit 10;

Done.

[(129, 'ni', 'Nigeria', 923768, 910768, 13000, 181562056, 2.45, 37.64, 12.9, 0.22)]

In [9]:
%%sql
select min(population) as 'Minimum Population', 
            max(population) as 'Maximum Population', 
                cast (min(population_growth) as float) as 'Minimum Population Growth',
                    max(population_growth) as 'Maximum Population Growth'
    from facts

Done.

[(0, 7256490011, 0.0, 4.02)]

In [10]:
%%sql
select name 
    from facts
    where population = (select min(population) from facts)

Done.

[('Antarctica',)]

In [11]:
%%sql
select name 
    from facts
    where population = (select max(population) from facts)

Done.

[('World',)]

In [23]:
%%sql
select min(population) as 'Minimum Population', 
            max(population) as 'Maximum Population', 
                cast (min(population_growth) as float) as 'Minimum Population Growth',
                    max(population_growth) as 'Maximum Population Growth'
    from facts
    where (population > (select min(population) from facts)) and (population < (select max(population) from facts))

Done.

[(48, 1367485388, 0.0, 4.02)]

In [27]:
%%sql
select round(AVG(population), 3) as avg_pop, round(avg(area), 3) as avg_area

 from facts

Done.

[(62094928.322, 555093.546)]

In [32]:
%%sql
select name, area, population from facts
where (population > (select avg(population) from facts)) and (area < (select avg(area) from facts))

Done.

[('Bangladesh', 148460, 168957745),
 ('Germany', 357022, 80854408),
 ('Japan', 377915, 126919659),
 ('Philippines', 300000, 100998376),
 ('Thailand', 513120, 67976405),
 ('United Kingdom', 243610, 64088222),
 ('Vietnam', 331210, 94348835)]

Highest densely populated countries, population by area estimates

In [38]:
%%sql
select name, population from facts
where population < (select max(population) from facts)
order by population desc
limit 10;

Done.

[('China', 1367485388),
 ('India', 1251695584),
 ('European Union', 513949445),
 ('United States', 321368864),
 ('Indonesia', 255993674),
 ('Brazil', 204259812),
 ('Pakistan', 199085847),
 ('Nigeria', 181562056),
 ('Bangladesh', 168957745),
 ('Russia', 142423773)]

Countries with the highest population

In [42]:
%%sql
select name, population, population_growth from facts
where population < (select max(population) from facts)
order by population_growth desc
limit 10;

Done.

[('South Sudan', 12042910, 4.02),
 ('Malawi', 17964697, 3.32),
 ('Burundi', 10742276, 3.28),
 ('Niger', 18045729, 3.25),
 ('Uganda', 37101745, 3.24),
 ('Qatar', 2194817, 3.07),
 ('Burkina Faso', 18931686, 3.03),
 ('Mali', 16955536, 2.98),
 ('Cook Islands', 9838, 2.95),
 ('Iraq', 37056169, 2.93)]

Coutries with the highest population growth, excluding the World

In [48]:
%%sql
select name, Cast(area_water as float)/cast(area_land as float) as land_water_ratio
from facts
order by land_water_ratio desc
limit 10

Done.

[('British Indian Ocean Territory', 905.6666666666666),
 ('Virgin Islands', 4.520231213872832),
 ('Puerto Rico', 0.5547914317925592),
 ('Bahamas, The', 0.3866133866133866),
 ('Guinea-Bissau', 0.2846728307254623),
 ('Malawi', 0.25939625850340137),
 ('Netherlands', 0.22571032366565366),
 ('Uganda', 0.22292237442922375),
 ('Eritrea', 0.16435643564356436),
 ('Liberia', 0.15623961794019933)]

list of countries with the highest ratios of water to land

In [50]:
%%sql
select name, area_land, area_water
from facts
where area_water > area_land

Done.

[('British Indian Ocean Territory', 60, 54340), ('Virgin Islands', 346, 1564)]

Countries that have more water area than land area

In [52]:
%%sql
select name, migration_rate
from facts
order by migration_rate desc
limit 10

Done.

[('Qatar', 22.39),
 ('American Samoa', 21.13),
 ('Micronesia, Federated States of', 20.93),
 ('Syria', 19.79),
 ('Tonga', 17.84),
 ('British Virgin Islands', 17.28),
 ('Luxembourg', 17.16),
 ('Cayman Islands', 14.4),
 ('Singapore', 14.05),
 ('Nauru', 13.63)]

countries that will add most people to their population next year

In [55]:
%%sql
select name, birth_rate, death_rate
from facts
where death_rate > birth_rate
limit 10

Done.

[('Austria', 9.41, 9.42),
 ('Belarus', 10.7, 13.36),
 ('Bosnia and Herzegovina', 8.87, 9.75),
 ('Bulgaria', 8.92, 14.44),
 ('Croatia', 9.45, 12.18),
 ('Czech Republic', 9.63, 10.34),
 ('Estonia', 10.51, 12.4),
 ('Germany', 8.47, 11.42),
 ('Greece', 8.66, 11.09),
 ('Hungary', 9.16, 12.73)]

Countries with higher death rate than birth rate and are more likely to have lesser population growth except they have high migration rate

In [59]:
%%sql
select name, population, cast(area_land as float)/cast(population as float) as population_by_area

from facts

order by population_by_area desc
limit 10

Done.

[('Greenland', 57733, 37.51902724611574),
 ('Svalbard', 1872, 33.14369658119658),
 ('Falkland Islands (Islas Malvinas)', 3361, 3.6218387384706934),
 ('Pitcairn Islands', 48, 0.9791666666666666),
 ('Mongolia', 2992908, 0.5190791029994908),
 ('Western Sahara', 570866, 0.46595873637596213),
 ('Namibia', 2212307, 0.3721409370399316),
 ('Australia', 22751014, 0.3376684661175981),
 ('Iceland', 331918, 0.3020324296964913),
 ('Mauritania', 3596702, 0.286568083761179)]

Countries with the highest population by area ration